#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПредыдущаяПиктограмма(Команда)
	
	МинимальноеЗначение = 2;
	СледующееЗначение = Запись.Картинка - 1;
	
	Если СледующееЗначение > МинимальноеЗначение Тогда	
		Запись.Картинка = СледующееЗначение;
	Иначе
		Запись.Картинка = МинимальноеЗначение;	
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура СледующаяПиктограмма(Команда)
	
	МаксимальноеЗначение = 5;
	СледующееЗначение = Запись.Картинка + 1;
	
	Если СледующееЗначение < МаксимальноеЗначение Тогда	
		Запись.Картинка = СледующееЗначение;
	Иначе
		Запись.Картинка = МаксимальноеЗначение;	
	КонецЕсли;
	           
КонецПроцедуры 

#КонецОбласти