
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура кл_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	кл_ИзменитьРеквизитыФормы();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура кл_ИзменитьРеквизитыФормы()
// BSLLS:DuplicateStringLiteral-off

	СтруктураКонтекста = Новый Структура;
	СтруктураКонтекста.Вставить("Группировка", ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
	СтруктураКонтекста.Вставить("РастягиватьПоГоризонтали", Ложь);
	
	КонтекстЭлемента = кл_РедакторФорм.СоздатьКонтекстЭлемента(
		ЭтотОбъект,
		Элементы.ЛокализацияГруппаСтраницаРоссийскогоКонтрагента,
		Элементы.ГруппаРезультатПроверкиКонтрагентов,
		СтруктураКонтекста);
	
	кл_ГруппаОКВЭД = кл_РедакторФорм.ДобавитьГруппуОбычную(КонтекстЭлемента, "кл_ГруппаОКВЭД");
	
	СтруктураКонтекста = Новый Структура;
	СтруктураКонтекста.Вставить("Подсказка", НСтр("ru='Код вида экономической деятельности'"));
	
	КонтекстЭлемента = кл_РедакторФорм.СоздатьКонтекстЭлемента(
		ЭтотОбъект,
		кл_ГруппаОКВЭД, ,
		СтруктураКонтекста);
		
	кл_РедакторФорм.ДобавитьПолеНаФормуРеквизитОбъекта(КонтекстЭлемента, "кл_ОКВЭД");
	
	СтруктураКонтекста = Новый Структура;
	СтруктураКонтекста.Вставить("Подсказка", НСтр("ru='Сфера деятельности контрагента'"));
	
	КонтекстЭлемента = кл_РедакторФорм.СоздатьКонтекстЭлемента(
		ЭтотОбъект,
		кл_ГруппаОКВЭД, ,
		СтруктураКонтекста);
		
	кл_РедакторФорм.ДобавитьПолеНаФормуРеквизитОбъекта(КонтекстЭлемента, "кл_СфераДеятельности");
		
	СтруктураКонтекста = Новый Структура;
	СтруктураКонтекста.Вставить("Группировка", ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
	СтруктураКонтекста.Вставить("РастягиватьПоГоризонтали", Ложь);
    СтруктураКонтекста.Вставить("ОтображатьЗаголовок", Истина);
    СтруктураКонтекста.Вставить("Заголовок", НСтр("ru='Кредитный лимит'"));
	
	КонтекстЭлемента = кл_РедакторФорм.СоздатьКонтекстЭлемента(
		ЭтотОбъект,
		Элементы.ГруппаНаименованияПартнер,
		Элементы.ГруппаПартнер,
		СтруктураКонтекста);
	
	кл_ГруппаКредитныйЛимит = кл_РедакторФорм.ДобавитьГруппуОбычную(КонтекстЭлемента, "кл_ГруппаКредитныйЛимит");

	СтруктураКонтекста = Новый Структура;
	СтруктураКонтекста.Вставить("РастягиватьПоГоризонтали", Ложь);
	
	КонтекстЭлемента = кл_РедакторФорм.СоздатьКонтекстЭлемента(
		ЭтотОбъект,
		кл_ГруппаКредитныйЛимит, ,
		СтруктураКонтекста);
		
	кл_РедакторФорм.ДобавитьПолеНаФормуРеквизитОбъекта(КонтекстЭлемента, "кл_КредитныйЛимит");		
	кл_РедакторФорм.ДобавитьПолеНаФормуРеквизитОбъекта(КонтекстЭлемента, "кл_Валюта");
		
	КонтекстЭлемента = кл_РедакторФорм.СоздатьКонтекстЭлемента(
		ЭтотОбъект,
		Элементы.ГруппаНаименованияПартнер,
		Элементы.ГруппаПартнер);
		
	кл_РедакторФорм.ДобавитьПолеНаФормуРеквизитОбъекта(КонтекстЭлемента, "кл_Менеджер");
	
	// BSLLS:DuplicateStringLiteral-on
КонецПроцедуры

#КонецОбласти