#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
     	
#Область ПрограммныйИнтерфейс

// Формирует цвет в зависимости от переданного качества решения
//
// Параметры:
//  Качество - ПеречислениеСсылка.КачествоРешенияЗадачи - Качество.
//
// Возвращаемое значение:
//  Цвет - цвет
//
Функция ЦветКачестваРешения(Качество) Экспорт
	
	Если Качество = ПредопределенноеЗначение("Перечисление.КачествоРешенияЗадачи.Великолепно") Тогда
	
		Цвет = Новый Цвет(78, 137, 174);	
	
	ИначеЕсли Качество = ПредопределенноеЗначение("Перечисление.КачествоРешенияЗадачи.Удовлетворительно") Тогда
		
		Цвет = Новый Цвет(255, 163, 114);	

	ИначеЕсли Качество = ПредопределенноеЗначение("Перечисление.КачествоРешенияЗадачи.ТяпЛяп") Тогда
		
		Цвет = Новый Цвет(237, 102, 99);	
		
	Иначе
	
		Цвет = Новый Цвет(211, 212, 216);	
	
	КонецЕсли;
	
	Возврат Цвет;	

КонецФункции 

#КонецОбласти

#КонецЕсли