#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
     	
#Область ПрограммныйИнтерфейс

Функция ЦветКачестваРешения(Качество) Экспорт
	
	Если Качество = ПредопределенноеЗначение("Перечисление.КачествоРешенияЗадачи.Великолепно") Тогда
	
		Цвет = WebЦвета.ЦветМорскойВолны;	
	
	ИначеЕсли Качество = ПредопределенноеЗначение("Перечисление.КачествоРешенияЗадачи.Удовлетворительно") Тогда
		
		Цвет = WebЦвета.СветлоЗолотистый;	

	ИначеЕсли Качество = ПредопределенноеЗначение("Перечисление.КачествоРешенияЗадачи.ТяпЛяп") Тогда
		
		Цвет = WebЦвета.Томатный;	
		
	Иначе
	
		Цвет = WebЦвета.Серый;	
	
	КонецЕсли;
	
	Возврат Цвет;	

КонецФункции 

#КонецОбласти

#КонецЕсли